<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
"http://www.w3.org/TR/RBC-html40/loose.dtd">

<html>

<head>
<title>Circuito Electromagn&eacute;tico Oscilatorio</title>
<meta name="description" content="Applet Java: Circuito Electromagn&eacute;tico Oscilatorio">
<meta name="author" content="Walter Fendt, Jos&eacute; Miguel Zamarro">
<meta name="keywords" content="f&iacute;sica, electrodin&aacute;mica, circuito oscillatorio">
</head>

<body bgcolor=#ffffff link=#0000ff vlink=#0000ff alink=#ff0000>

<table width="100%" bgcolor=#0000FF cellpadding=10><tr><td>
<table width="100%" bgcolor=#FFFF00 cellpadding=5><tr><td align="center">
<p align="center">
<b><font face="Berlin Sans FB Demi" size="6" color="#FF0000">

Circuito LC</font></b></td></tr></table>
</td></tr></table>

<p><b>Esta simulaci&oacute;n trata sobre un circuito electromagn&eacute;tico oscilatorio formado por un condensador (centro) y una autoinducci&oacute;n (una bobina a la derecha). En cuanto se presiona el bot&oacute;n &quot;Reiniciar&quot; las placas del condensador se cargan, la placa superior positivamente y la inferior negativamente. Despu&eacute;s de presionar el bot&oacute;n &quot;Iniciar&quot; el conmutador se desplaza a la otra posici&oacute;n y la oscilaci&oacute;n comienza. El bot&oacute;n &quot;Pausa&nbsp;/&nbsp;Reanudar&quot; permite interrumpir y reanudar la simulaci&oacute;n. La animaci&oacute;n se enlentecer&aacute; 10 o 100 veces seg&uacute;n la selecci&oacute;n que se efect&uacute;e. Se puede modificar el valor de la capacidad (de 100&nbsp;<font face="Symbol">m</font>F a 1000&nbsp;<font face="Symbol">m</font>F), la inductancia de la bobina (de 1&nbsp;H a 10&nbsp;H) y la resistencia (de 0&nbsp;<font face="Symbol">W</font> a 1000&nbsp;<font face="Symbol">W</font>) y el voltaje de la bater&iacute;a utilizando los cuatro campos de texto.</b></p>

<p><b>El campo el&eacute;ctrico del condensador (rojo) y el campo magn&eacute;tico de la inducci&oacute;n (azul) se muestran mediante l&iacute;neas de campo en el diagrama del circuito. La densidad de estas l&iacute;neas muestra la intensidad del campo correspondiente. Adem&aacute;s puede ver los signos de la carga de las placas del condesador y flechas para la direcci&oacute;n (convencional) de la corriente.</b></p>

<p><b>En la parte inferior izquierda un reloj digital indica el tiempo desde el comienzo de la oscilaci&oacute;n; debajo se indica el per&iacute;odo de la oscilaci&oacute;n. En la parte inferior izquierda se ve uno de los dos diagramas dependiendo de la selecci&oacute;n realizada en la parte inferior del panel de control:<br>
1. Diagrama que muestra c&oacute;mo var&iacute;an el voltaje U (azul) y la corriente I (rojo) con el tiempo.<br>
2. Un gr&aacute;fico de barras que describe las transformaciones de enrg&iacute;a.</b></p>


<p align="center">
    <applet archive="Schwingkreis.jar" code="Schwingkreis.class" codebase="../../../../jarph/" width=700 height=420>
    <param name="language" value="Spanish">
    </applet></p>

</body>

</html>