<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
"http://www.w3.org/TR/RBC-html40/loose.dtd">

<html>

<head>
<title>Campo Magn&eacute;tico de una Corriente Rectil&iacute;nea</title>
<meta name="description" content="Applet Java: Campo magn&eacute;tico de una corriente rectil&iacute;nea">
<meta name="author" content="Walter Fendt, Jos&eacute; Miguel Zamarro">
<meta name="keywords" content="f&iacute;sica, electrodin&aacute;mica, campo magn&eacute;tico, corriente">
</head>


<body bgcolor=#ffffff link=#0000ff vlink=#0000ff alink=#ff0000>

<table width="100%" bgcolor=#0000ff cellpadding=10><tr><td>
<table width="100%" bgcolor=#ffff00 cellpadding=5><tr><td align="center">
<p align="left">
<b>
<font size=6 face="Berlin Sans FB Demi" color="#FF0000">
<img border="0" src="../../../../../../Ensino/Electromagnetismo/imagens/Logo.bmp" width="104" height="57"></font><font size=6 face="Bodoni MT" color="#FF0000">Campo Magn&eacute;tico 
duma Corrente Retilínea. </font>
</b>
</td></tr></table>
</td></tr></table>

<p><b>Una corriente el&eacute;ctrica produce un campo m&aacute;gn&eacute;tico. Este applet simula una experiencia relativa al campo magn&eacute;tico generado por una corriente el&eacute;ctrica continua que circula por un hilo rectil&iacute;neo indefinido. Una corriente intensa circula por un hilo vertical. Se puede invertir el sentido de la corriente mediante el bot&oacute;n rojo. Los signos en los extremos del hilo simbolizan la polaridad de la bater&iacute;a conectada. La direcci&oacute;n convencional de la corriente viene dada por las flechas rojas. ¡Observe que el movimiento de los electrones (puntos verdes) es opuesta a la direcci&oacute;n convenida de la corriente!</b></p>

<p><b>Una aguja imanada que puede ser desplazada (arrastrando el rat&oacute;n con el bot&oacute;n presionado) muestra la direcci&oacute;n del campo magn&eacute;tico (azul) en una posici&oacute;n dada. Los polos norte y sur de la aguja est&aacute;n pintados de color rojo y verde respectivamente. Se desprecia la influencia del campo magn&eacute;tico terrestre.</b></p>

<p align="center">
<applet archive="MFLeiter.jar" code="MFLeiter.class" codebase="../jarph/" width=500 height=380>
<param name="language" value="Spanish">
</applet></p>

<p><b>Las l&iacute;neas de campo magn&eacute;tico de una corriente continua rectil&iacute;nea forman c&iacute;rculos conc&eacute;ntricos alrededor del hilo conductor. La direcci&oacute;n del campo magn&eacute;tico (flechas azules) viene dada por la regla de la mano derecha: Cuando el pulgar de la mano derecha señala la direcci&oacute;n de la corriente, los otros dedos rodean el hilo conductor en la direcci&oacute;n del campo magn&eacute;tico.</b></p>

</body>

</html>